In [3]:
import pandas as pd

# DataFrame

In [10]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
     'year':[2000,2001,2001,2002,2003,2004],
     'pop':[1.4,1.3,1.2,1.3,1.5,1.6],
     'country':['India','pak','china','nepal','bhutan','japan']}

In [11]:
frame=pd.DataFrame(data)

In [12]:
frame

    state  year  pop country
0    Ohio  2000  1.4   India
1    Ohio  2001  1.3     pak
2    Ohio  2001  1.2   china
3  Nevada  2002  1.3   nepal
4  Nevada  2003  1.5  bhutan
5  Nevada  2004  1.6   japan

In [13]:
frame.head(2)

  state  year  pop country
0  Ohio  2000  1.4   India
1  Ohio  2001  1.3     pak

In [14]:
frame.tail(1)

    state  year  pop country
5  Nevada  2004  1.6   japan

In [17]:
frame.notnull()

   state  year   pop  country
0   True  True  True     True
1   True  True  True     True
2   True  True  True     True
3   True  True  True     True
4   True  True  True     True
5   True  True  True     True

In [27]:
pd.DataFrame(data,columns=['years','country'])

  years country
0   NaN   India
1   NaN     pak
2   NaN   china
3   NaN   nepal
4   NaN  bhutan
5   NaN   japan

In [28]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                   index=['one','two','three','four','five','six'])

In [29]:
frame2

       year   state  pop debt
one    2000    Ohio  1.4  NaN
two    2001    Ohio  1.3  NaN
three  2001    Ohio  1.2  NaN
four   2002  Nevada  1.3  NaN
five   2003  Nevada  1.5  NaN
six    2004  Nevada  1.6  NaN

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.year

one      2000
two      2001
three    2001
four     2002
five     2003
six      2004
Name: year, dtype: int64

In [34]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [40]:
frame2.loc['two']

year     2001
state    Ohio
pop       1.3
debt      NaN
Name: two, dtype: object

In [41]:
frame2['debt']=16.5

In [42]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.4  16.5
two    2001    Ohio  1.3  16.5
three  2001    Ohio  1.2  16.5
four   2002  Nevada  1.3  16.5
five   2003  Nevada  1.5  16.5
six    2004  Nevada  1.6  16.5

In [49]:
frame2

           year   state    pop   debt
one    2000.000    Ohio  1.400  1.200
two    2001.000    Ohio  1.300  1.200
three  2001.000    Ohio  1.200  1.200
four   2002.000  Nevada  1.300  1.200
five   2003.000  Nevada  1.500  1.200
six    2004.000  Nevada  1.600  1.200
debt      1.222   1.222  1.222  1.222

In [61]:
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val

In [62]:
frame2

           year   state    pop  debt
one    2000.000    Ohio  1.400   NaN
two    2001.000    Ohio  1.300  -1.2
three  2001.000    Ohio  1.200   NaN
four   2002.000  Nevada  1.300  -1.5
five   2003.000  Nevada  1.500  -1.7
six    2004.000  Nevada  1.600   NaN
debt      1.222   1.222  1.222   NaN

In [67]:





frame2['eastern']='sumant'
frame2

           year  state    pop  debt eastern
one    2000.000   True  1.400   NaN  sumant
two    2001.000   True  1.300  -1.2  sumant
three  2001.000   True  1.200   NaN  sumant
four   2002.000   True  1.300  -1.5  sumant
five   2003.000   True  1.500  -1.7  sumant
six    2004.000   True  1.600   NaN  sumant
debt      1.222   True  1.222   NaN  sumant

In [68]:
del frame2['eastern']

In [69]:
frame2

           year  state    pop  debt
one    2000.000   True  1.400   NaN
two    2001.000   True  1.300  -1.2
three  2001.000   True  1.200   NaN
four   2002.000   True  1.300  -1.5
five   2003.000   True  1.500  -1.7
six    2004.000   True  1.600   NaN
debt      1.222   True  1.222   NaN

In [70]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [71]:
pop={'Nevada':{2001:2.4,2002:2.9}}

In [72]:
frame2

           year  state    pop  debt
one    2000.000   True  1.400   NaN
two    2001.000   True  1.300  -1.2
three  2001.000   True  1.200   NaN
four   2002.000   True  1.300  -1.5
five   2003.000   True  1.500  -1.7
six    2004.000   True  1.600   NaN
debt      1.222   True  1.222   NaN

In [73]:
frame3=pd.DataFrame(pop)

In [74]:
frame3

      Nevada
2001     2.4
2002     2.9

In [75]:
frame3.T

        2001  2002
Nevada   2.4   2.9

In [76]:
frame3.index.name='year';frame3.columns.name='state'

In [77]:
frame3

state  Nevada
year
2001      2.4
2002      2.9

In [78]:
frame3.values

array([[2.4],
       [2.9]])

In [79]:
frame2.values

array([[2000.0, True, 1.4, nan],
       [2001.0, True, 1.3, -1.2],
       [2001.0, True, 1.2, nan],
       [2002.0, True, 1.3, -1.5],
       [2003.0, True, 1.5, -1.7],
       [2004.0, True, 1.6, nan],
       [1.222, True, 1.222, nan]], dtype=object)

# Index Object

In [80]:
 obj=pd.Series(range(3),index=['a','b','c'])

In [82]:
index=obj.index

In [83]:
index

Index(['a', 'b', 'c'], dtype='object')

In [86]:
obj=pd.Series(range(10),index=[1,1,1,1,1,1,1,1,1,1])

In [87]:
obj

1    0
1    1
1    2
1    3
1    4
1    5
1    6
1    7
1    8
1    9
dtype: int64

In [91]:
obj[1:]

1    1
1    2
1    3
1    4
1    5
1    6
1    7
1    8
1    9
dtype: int64

In [92]:
obj[1]='sumant'

In [93]:
obj

1    sumant
1    sumant
1    sumant
1    sumant
1    sumant
1    sumant
1    sumant
1    sumant
1    sumant
1    sumant
dtype: object

In [95]:
import numpy as np

In [96]:
labels=pd.Index(np.arange(3))

In [97]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [98]:
obj2=pd.Series([1.5,-2.3,0],index=labels)

In [99]:
obj2

0    1.5
1   -2.3
2    0.0
dtype: float64

In [101]:
obj2.index is labels

True

##

In [108]:
frame3={'SS':{2001:2.4,2002:2.9}}

In [110]:

frame3.differnce()

AttributeError: 'dict' object has no attribute 'differnce'

# Essential functionality

# Reindexing

In [112]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['a','b','c','d'])

In [113]:
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [115]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a    4.5
b    7.2
c   -5.3
d    3.6
e    NaN
dtype: float64

In [116]:
obj3=pd.Series(['Blue','perpal','yellow'],index=[0,2,4])
obj3

0      Blue
2    perpal
4    yellow
dtype: object

In [127]:

obj3.reindex(range(6),method='bfill')

0      Blue
1    perpal
2    perpal
3    yellow
4    yellow
5       NaN
dtype: object

In [122]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [124]:
frame2=pd.DataFrame(np.arange(16).reshape(4,4),index=[1,2,3,4],columns=['Sumant',"Kumar",'singh','Kuma'])
frame2

   Sumant  Kumar  singh  Kuma
1       0      1      2     3
2       4      5      6     7
3       8      9     10    11
4      12     13     14    15

In [125]:
frame2=frame.reindex(['a','b','c','d'])

In [126]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

# Dropping Enteries From An Axis

In [130]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [131]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [132]:
new_obj=obj.pop('a')
new_obj

0.0